Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: To create a selector for a method that can be called from Objective-C, pass the name of the method, such as #selector(MyViewController.tappedButton(_:)).
ja: Objective-Cから呼び出されることができるメソッドに対してセレクタを作成するには、そのメソッドの名前を渡してください、例えば#selector(MyViewController.tappedButton(_:))のように。

source: To customize the name of an enumeration case, you can use the NS_SWIFT_NAME macro, passing the Swift enumeration case name.
ja: 列挙ケース節の名前をカスタマイズするために、あなたはスウィフト列挙ケース節名を渡して、NS_SWIFT_NAMEマクロを使うことができます。

source: To declare a type that conforms to a single protocol in Swift code, use the protocol name directly as its type (as compared to id<SomeProtocol> in Objective-C).
ja: ただ１つのプロトコルに準拠する型をスウィフトコードにおいて定義するには、そのプロトコル名を直接にそれの型として使ってください（Objective-Cでのid<SomeProtocol>になぞらえられる）。

source: To declare a type that conforms to multiple protocols in Swift code, use a protocol composition, which takes the form SomeProtocol & AnotherProtocol (as compared to id<SomeProtocol, AnotherProtocol> in Objective-C).
ja: 複数のプロトコルに準拠する型をスウィフトコードにおいて定義するには、プロトコル合成物を使ってください、それは形式SomeProtocol & AnotherProtocolをとります（Objective-Cでのid<SomeProtocol, AnotherProtocol>になぞらえられる）。

source: To do this, change the Product Module Name build setting.
ja: これをするために、「Product Module Name」ビルド設定を変更してください。

source: To ensure that your app can accommodate any differences in functionality, you check the availability those APIs.
ja: あなたのアプリが機能性でのどんな違いでも調整できることを確実にするために、あなたはそれらのAPIの有効性を確認します。

source: To import Objective-C code into Swift from the same framework
ja: 同じフレームワークからスウィフトにObjective-Cコードをインポートするには

source: To import Objective-C code into Swift from the same target
ja: 同じターゲットからObjective-Cコードをスウィフトにインポートするには

source: To import Swift code into Objective-C from the same framework
ja: スウィフトコードを同じフレームワークからObjective-Cにインポートするには

source: To import Swift code into Objective-C from the same target
ja: 同じターゲットからObjective-Cにスウィフトコードをインポートするには

source: To import a set of Objective-C files in the same app target as your Swift code, you rely on an Objective-C bridging header to expose those files to Swift.
ja: あなたのスウィフトコードと同じアプリターゲットにひとそろいのObjective-Cファイルをインポートするために、あなたはObjective-C橋渡しヘッダを当てにしてそれらのファイルをスウィフトに露出します。

source: To import a set of Objective-C files in the same framework target as your Swift code, you’ll need to import those files into the Objective-C umbrella header for the framework.
ja: ひとそろいのObjective-Cファイルをあなたのスウィフトコードと同じフレームワークターゲットにインポートするために、あなたはそれらのファイルをそのフレームワークのためのObjective-Cアンブレラヘッダにインポートする必要があります。

source: To import a set of Swift files in the same framework target as your Objective-C code, you don’t need to import anything into the umbrella header for the framework.
ja: ひとそろいのスウィフトファイルをあなたのObjective-Cコードと同じフレームワークターゲットにインポートするために、あなたはそのフレームワークのためのアンブレラヘッダに何もインポートする必要がありません。

source: To inform the caller when initialization has failed, an Objective-C initializer can return nil.
ja: 初期化が失敗した時に呼び出し側に報告するために、Objective-Cイニシャライザはnilを返すことができます。

source: To instantiate an Objective-C class in Swift, you call one of its initializers using Swift initializer syntax.
ja: Objective-Cクラスをスウィフトにおいてインスタンス化するために、あなたはそれのイニシャライザのうちの１つをスウィフト初期化構文を使って呼び出します。

source: To log a message to a specific subsystem, you can create a new OSLog object, specifying the subsystem and category, and pass it as a parameter to the os_log function.
ja: ある特定のサブシステムに対するメッセージをログするには、あなたは新しいOSLogオブジェクトを作成して、そのサブシステムとカテゴリを指定します、そしてそれをパラメータとしてos_log関数に渡します。

source: To make an Objective-C declaration unavailable at compile time in both Swift and Objective-C, use the NS_UNAVAILABLE macro.
ja: Objective-C宣言をコンパイル時にSwiftとObjective-Cの両方で利用できなくするには、NS_UNAVAILABLEマクロを使ってください。

source: To make your Swift class accessible and usable back in Objective-C, make it a descendant of an Objective-C class.
ja: あなたのスウィフトクラスをObjective-Cから逆にアクセス可能および使用可能にするために、それをObjective-Cクラスの子孫にしてください。

source: To prevent a strong reference cycle, you can specify self to be unowned in a closure’s capture list:
ja: 強い参照循環を防ぐために、あなたはselfをunownedであるとクロージャのキャプチャリストにおいて指定することができます：

source: To prevent an Objective-C declaration from being imported by Swift, use the NS_SWIFT_UNAVAILABLE macro, passing a message directing API consumers to any alternatives that may exist.
ja: あるObjective-C宣言がスウィフトによってインポートされるのを防止するために、NS_SWIFT_UNAVAILABLEマクロを使って、API消費者に存在するであろう何らかの代替手段を指示するメッセージを渡してください。

source: To provide a refined Swift interface to C functionality, create an overlay by declaring new Swift functions that make the necessary C function calls in their implementation.
ja: 洗練されたスウィフトインターフェイスをCの機能性に提供するには、必要なC関数をそれの実装において呼び出すようにする新しいスウィフト関数を定義することによって、オーバーレイを作成してください。

source: To provide your own implementations of the superclass’s methods, use the override modifier.
ja: そのスーパークラスの持つメソッドのあなた独自の実装を提供するには、override修飾子を使ってください。

source: To specify a particular name for the class to use in Objective-C, mark it with @objc(name), where name is the name that your Objective-C code uses to reference the Swift class.
ja: クラスに対してObjective-Cで使うために特定の名前を指定するために、それを@objc(name)で印してください、そこにおいてnameはあなたのObjective-Cコードがスウィフトクラスを参照するために使う名前です。

source: To start experimenting with Cocoa app development using Swift, create a new Swift project from one of the provided Xcode templates.
ja: スウィフトを使うCocoaアプリ開発の実験を始めるために、提供されるXcodeテンプレートの１つから新規スウィフトプロジェクトを作成してください。

source: To start using the object, you use the takeUnretainedValue() function.
ja: そのオブジェクトを使い始めるために、あなたはtakeUnretainedValue()関数を使用します。

source: To use outlets and actions in Swift, insert @IBOutlet or @IBAction just before the property or method declaration.
ja: スウィフトにおいてアウトレットとアクションを使うために、プロパティまたはメソッド宣言の直前に@IBOutletまたは@IBActionを書き込んでください。

source: Top-level functions defined in Swift
ja: スウィフトにおいて定義されるトップレベル関数

source: Treat your Swift and Objective-C files as the same collection of code, and watch out for naming collisions.
ja: あなたのスウィフトとObjective-Cファイルを同じコードのコレクションとみなしてください、そして名前衝突に気をつけてください。

source: Troubleshooting Tips and Reminders
ja: 問題解決の秘訣と注意

source: Tuples
ja: タプル

source: Typealiases defined in Swift
ja: スウィフトにおいて定義される型エイリアス

source: Types declared to be nonnullable, either with a _Nonnull annotation or in an audited region, are imported by Swift as a nonoptional.
ja: 非ヌル可能として定義された型、_Nonnull注釈を使ってまたはある監査された領域の中の両方、は、スウィフトによって非オプショナルとしてインポートされます。

source: Types declared to be nullable with a _Nullable annotation, are imported by Swift as an optional.
ja: ヌル可能として_Nullable注釈を使って定義された型は、スウィフトによってオプショナルとしてインポートされます。

source: Types declared without a nullability annotation are imported by Swift as an implicitly unwrapped optional.
ja: ヌル可能注釈を使わずに定義された型は、スウィフトによって暗黙的にアンラップされるオプショナルとしてインポートされます。

source: Types that are pointed to are not bridged.
ja: ポインターで指される型は、橋渡しされません。

source: Types that can be converted between Objective-C and Swift are referred to as bridged types.
ja: Objective-Cとスウィフトの間で変換されることが可能な型は、ブリッジ（橋渡しされる）型と呼ばれます。

source: Typically, you don’t need to create your own autorelease pool blocks, but there are some situations in which either you must—such as when spawning a secondary thread—or it is beneficial to do so—such as when writing a loop that creates many temporary objects.
ja: 概して、あなたはあなた独自のオートリリース・ブロックを作成する必要はありません、しかしいくつかの状況があり、そこにおいては、あなたが必要とする—例えば副次的スレッドを生み出す時など—もしくはそうすることが利益をもたらす—例えば多くの一時的オブジェクトを作成するあるループを書く時など—のいずれかです。

source: Under Build Settings, in Packaging, make sure the Defines Module setting for that framework target is set to “Yes”.
ja: 「Build Settings」において、「Packaging」の中で、そのフレームワークターゲットのための「Defines Module」設定が「Yes」に設定されることを確認します。

source: Understanding the Swift Import Process
ja: スウィフトのインポートプロセスを理解する

source: Undo
ja: 取り消し

source: Unified Logging
ja: 統合ログ

source: Unified logging is available in iOS 10.0 and later, macOS 10.12 and later, tvOS 10.0 and later, and watchOS 3.0 and later.
ja: 統合ログは、iOS 10.0以降、macOS 10.12以降、tvOS 10.0以降、そしてwatchOS 3.0以降で利用可能です。

source: Unions
ja: 共用体

source: Unlike Objective-C, where all classes are part of a global namespace–and must not have the same name–Swift classes can be disambiguated based on the module they reside in.
ja: Objective-Cとは違い、全てのクラスがグローバルな名前空間の一部である ― それゆえ同じ名前を持ってはならない ― ところで、スウィフトクラスは、それらが属するモジュールに基づいて違いを明らかにされることができます。

source: Unlike key paths created using key-path expressions, key paths created using the #keyPath string expression don’t pass type information about the properties or methods they reference to the APIs that accept key paths.
ja: キーパス式を使って作成されるキーパスと違い、#keyPath文字列式を使って作成されるキーパスは、それらが参照するプロパティやメソッドについての型情報をキーパスを受け入れるAPIへ伝えません。

source: Unmanaged Objects
ja: 管理されないオブジェクト

source: Unnamed Structure and Union Fields
ja: 無名の構造体と共用体フィールド

source: Unnamed fields consist of a nested struct or union type with named fields.
ja: 無名フィールドは、入れ子にされたstructまたはunionで名前付きフィールドを持つものから成ります。

source: Unrecognized Selectors and Optional Chaining
ja: 識別不能セレクタとオプショナル連鎖

source: Unsafe Invocation of Objective-C Methods
ja: Objective-Cメソッドの安全でない発動

source: Update import statements in your Objective-C code (to #import "ProductModuleName-Swift.h"), as described in Importing Code from Within the Same App Target.
ja: あなたのObjective-Cコードにおいてインポート文を更新してください（#import "ProductModuleName-Swift.h"へと）、コードを同じアプリターゲットからインポートするで記述されるように。

source: Update your code to use the Swift class name instead of the Objective-C name if you gave the Swift class a different name.
ja: あなたがスウィフトクラスに異なる名前を与えるならば、Objective-C名でなくてスウィフトクラス名を使用するようにあなたのコードを更新してください。

source: Updated Constant Pointers section with information about bridging Swift String values to C pointers.
ja: 章定数ポインターをスウィフトのString値からCポインターへの橋渡しについての情報で更新した。

source: Updated an example in the Key-Value Observing section to use #keyPath instead of string literals.
ja: キー値監視の節の例を更新して、#keyPathを文字列リテラルの代わりに使うようにした。

source: Updated and expanded the Swift Type Compatibility section in the Interacting with Objective-C APIs chapter.
ja: スウィフト型互換性節をC APIとの相互作用章において更新および拡張した。

source: Updated and expanded the Bridging Collections section in the Working with Cocoa Frameworks chapter.
ja: ブリッジコレクション節をココアフレームワークを扱う章において更新および拡張した。

source: Updated for Swift 1.1.
ja: Swift 1.1にふさわしく更新した。

source: Updated for Swift 1.2.
ja: Swift 1.2にふさわしく更新した。

source: Updated for Swift 2.0.
ja: Swift 2.0にふさわしく更新した。

source: Updated for Swift 2.1.
ja: Swift 2.1にふさわしく更新した。

source: Updated for Swift 2.2.
ja: Swift 2.2にふさわしく更新した。

source: Updated for Swift 3.0.
ja: Swift 3.0にふさわしく更新した。

source: Updated for Swift 3.0.1.
ja: Swift 3.0.1にふさわしく更新した。

source: Updated for Swift 3.1.
ja: Swift 3.1にふさわしく更新した。

source: Updated for Swift 4.0.
ja: Swift 4.0にふさわしく更新した。

source: Updated screenshots of Xcode user interface.
ja: Xcodeユーザインターフェイスのスクリーンショットを更新した。

source: Updated the CFArrayCreateMutable code sample in the Function Pointers section.
ja: CFArrayCreateMutableコードサンプルを関数ポインター節において更新した。

source: Updated the API Availability section and the Conditional Compilation Blocks section with information about tvOS.
ja: API有効性節と条件コンパイルブロック節をtvOSについての情報で更新した。

source: Updated the Accessing Properties section with additional information about how Objective-C property attributes are imported by Swift.
ja: プロパティにアクセスする節をどのようにObjective-Cプロパティ属性がスウィフトによってインポートされるかについての追加情報で更新した。

source: Updated the Adopting Protocols section to describe how to constrain the type of a variable or constant to multiple protocols.
ja: プロトコルを採用するの節を更新して、どのように変数や定数の型に対して複数のプロトコルの制約を加えるかについて記述した。

source: Updated the Conditional Compilation Blocks section with information about the swift build configuration.
ja: 条件コンパイルブロック節をswiftビルド構成についての情報で更新した。

source: Updated the Configuring Swift Interfaces in Objective-C section with information about the @nonobjc attribute.
ja: 節スウィフトインターフェイスをObjective-Cにおいて構成するを@nonobjc属性についての情報で更新した。

source: Updated the Configuring Swift Interfaces in Objective-C section with information about using the @objc(name) attribute with Swift enumerations.
ja: スウィフトインターフェイスをObjective-Cにおいて構成する節をスウィフト列挙とともに@objc(name)属性を使用することについての情報で更新した。

source: Updated the Configuring Swift Interfaces in Objective-C section with information about using the @objc attribute for Swift enumerations.
ja: スウィフトインターフェイスをObjective-Cにおいて構成するの節をスウィフト列挙に@objc属性を使うことについての情報で更新した。

source: Updated the Data Type Size Calculation section with information about the MemoryLayout type.
ja: データ型サイズ計算の節を更新して、MemoryLayout型についての情報を含めた。

source: Updated the Enumerations section with information about how C enumerations not marked with the NS_ENUM or NS_OPTIONS macro are imported by Swift.
ja: 列挙節を、どのようにNS_ENUMまたはNS_OPTIONSマクロで印されないC列挙がスウィフトによってインポートされるかについての情報で更新した。

source: Updated the Error Handling section to reflect that Swift removes the WithError suffix from the selector of an error-producing Objective-C method, when that method is imported as a Swift method that throws.
ja: 節エラーの処理を更新して、「エラーを生じる」Objective-Cメソッドのセレクタから、そのメソッドがスローするスウィフトメソッドとしてインポートされる時に、スウィフトがWithError接尾辞を取り除いたことを反映した。

source: Updated the Error Handling section with information about the NS_ERROR_RESULT Objective-C macro.
ja: エラーの処理節をNS_ERROR_RESULT Objective-Cマクロについての情報で更新した。

source: Updated the Failable Initialization section with information about nullability annotations.
ja: 節失敗できる初期化をヌル許可注釈についての情報で更新した。

source: Updated the Function Pointers section with information about bridging Swift function and closure values with C function pointers.
ja: 関数ポインターの章をスウィフト関数やクロージャとC関数ポインタとの橋渡しについての情報で更新した。

source: Updated the Hashing section with information about the AnyHashable type.
ja: ハッシュ化の節を更新して、AnyHashable型についての情報を含めた。

source: Updated the Interacting with Objective-C APIs chapter with information about how Swift imports Objective-C id types as Any.
ja: Objective-C APIとの相互作用の章を更新して、どのようにスウィフトがObjective-C id型をAnyとしてインポートするかの情報を含めた。

source: Updated the Object Comparison section and Hashing section in the Interacting with Objective-C APIs chapter.
ja: オブジェクト比較節とハッシュ化節をC APIとの相互作用章において更新した。

source: Updated the Pointers section to reflect that CMutablePointer and CMutableVoidPointer have been replaced with UnsafePointer, and CConstPointer and CConstVoidPointer have been replaced with ConstUnsafePointer.
ja: 節ポインターを更新して、CMutablePointerとCMutableVoidPointerがUnsafePointerと置き換えられ、CConstPointerとCConstVoidPointerがConstUnsafePointerと置き換えられたことを反映するようにした。

source: Updated the Pointers section to reflect that UnsafePointer has been replaced with UnsafeMutablePointer, ConstUnsafePointer has been replaced with UnsafePointer, and AutoreleasingUnsafePointer has been replaced with AutoreleasingUnsafeMutablePointer.
ja: 節ポインターを更新して、UnsafePointerがUnsafeMutablePointerと置き換えられ、ConstUnsafePointerがUnsafePointerと置き換えられ、そしてAutoreleasingUnsafePointerがAutoreleasingUnsafeMutablePointerと置き換えられることを反映するようにした。

source: Updated the Pointers section with information about the UnsafeRawPointer and UnsafeMutableRawPointer types.
ja: ポインターの節を更新して、UnsafeRawPointerとUnsafeMutableRawPointer型の情報を含めた。

source: Updated the Pointers section with information about the duration of pointers passed to inout parameters.
ja: ポインター節をinoutパラメータに渡されたポインタの継続期間についての情報で更新した。

source: Updated the Selectors section with information about the Swift #selector expression.
ja: セレクタ節をスウィフトの#selector式についての情報で更新した。

source: Updated the Setting Up Your Swift Environment section with information about base SDK requirements for Swift apps.
ja: あなたのスウィフト環境を設定する節をスウィフトアプリに対する基盤SDK要件についての情報で更新した。

source: Updated the Swift Type Compatibility and Configuring Swift Interfaces in Objective-C sections now that the @objc attribute can only be applied to classes that descend from NSObject.
ja: スウィフト型互換性とスウィフトインターフェイスをObjective-Cにおいて構成する節を更新した、今では@objc属性はただNSObjectの系統を引くクラスにだけ適用されることが可能です。

source: Updated the Swift and Objective-C in the Same Project chapter with information about access control in mixed-language targets.
ja: 章同じプロジェクト内のスウィフトとObjective-Cを混合言語ターゲットでのアクセス制御ついての情報で更新した。

source: Updated the Swift and Objective-C in the Same Project chapter with information about the @testable attribute.
ja: 同じプロジェクト中のスウィフトとObjective-Cの章を@testable属性についての情報で更新した。

source: Updated the Swift and Objective-C in the Same Project chapter with information about the open and fileprivate access modifiers.
ja: 同じプロジェクト中のスウィフトとObjective-Cの章を更新して、openとfileprivateアクセス修飾子についての情報を含めた。

source: Updated the Working with Cocoa Frameworks chapter to use the as! operator and bridging semantics in Swift 1.2.
ja: 章ココアフレームワークを扱うをas!演算子の利用とスウィフト 1.2における意味論との溝を埋めるために更新した。

source: Updated the Bridging Collections section to discuss Swift bridging of parameterized Objective-C collection classes.
ja: 「ブリッジコレクション」節をパラメーター化されたObjective-Cコレクションクラスのスウィフト橋渡しについての情報で更新した。

source: Updated the Core Data section to include directions to configure the managed object model.
ja: コアデータの節を更新してオブジェクトモデル管理のための指針を含めた。

source: Updated the discussion in Processing Command-Line Arguments, now that Process has been renamed to CommandLine.
ja: コマンドライン引数の処理での議論を更新した、今ではProcessはCommandLineと改名されてしまっています。

source: Updated the discussion in the Numbers section of the Working with Cocoa Frameworks chapter, now that as? casts fail when attempting to convert an NSNumber to a numeric type that isn’t large enough to fit the entire number.
ja: 数の節での議論をCocoaフレームワークを扱うの章で更新した、今ではas?キャストはNSNumberをその数全体をはめ込むには十分に大きくない数値型に変換する場合に失敗します。

source: Updated the discussion in the Protocol-Qualified Classes section now that classes are imported as part of protocol compositions.
ja: プロトコル適格クラスの節での議論を更新した、今ではクラスはプロトコル合成の一部としてインポートされます。

source: Updated the discussion in the Requiring Dynamic Dispatch and Inheriting from Objective-C Classes sections, now that the @objc attribute is inferred in fewer contexts.
ja: 動的なディスパッチを要求するとObjective-Cクラスから継承するの節での議論を更新した、今では@objc属性はより新しい文脈において継承されます。

source: Updated the discussion in the Requiring Dynamic Dispatch section to include @objc and dynamic.
ja: 動的なディスパッチを要求するの節での議論を更新して@objcとdynamicを含めた。

source: Updated the discussion in the Serialization section to include the new encoders and decoders for JSON and property list data.
ja: シリアライズの節での議論を更新して、新しいJSONおよびプロパティリストデータのためのエンコーダとデコーダを含めた。

source: Updated the discussion in the Unions and Unnamed Structure and Union Fields sections, now that unnamed fields from C structures and unions are always imported.
ja: 共用体と無名構造体と共用体フィールドの節での議論を更新した、今ではC構造体と共用体からの無名フィールドは常にインポートされます。

source: Updated the discussion of the @NSManaged attribute in the Implementing Core Data Managed Object Subclasses section, now that the attribute can be applied to certain instance methods.
ja: @NSManaged属性の説明をコアデータ管理オブジェクトのサブクラスを実装するの節において更新した、今ではこの属性は特定のインスタンスメソッドに適用可能です。

source: Updated the example in the Key-Value Observing section, now that the key-value observing APIs accept key-path expressions.
ja: キー値監視の節での例を更新した、今ではキー値監視APIはキーパス式を受け入れます。

source: Updated the introductions of the Interacting with Objective-C APIs chapter.
ja: 導入部をObjective-C APIとの相互作用章において更新した。

source: Use NS_TYPED_ENUM for sets of values that can’t logically have additional values added by code in adopting modules.
ja: 採用しているモジュールの中のコードによって追加的な値を加えられることが論理的に不可能な値の集合に対して、NS_TYPED_ENUMを使ってください。

source: Use NS_TYPED_EXTENSIBLE_ENUM for sets of values which may be expanded in a Swift extension.
ja: あるスウィフト拡張において拡張されるかもしれない値の集合に対して、NS_TYPED_EXTENSIBLE_ENUMを使ってください。

source: Use the @objc(name) attribute to provide Objective-C names for properties and methods when necessary.
ja: @objc(name)属性をObjective-C名をプロパティとメソッドに必要に応じて用意するために使ってください。

source: Use the NS_SWIFT_NOTHROW macro on an Objective-C method declaration that produces an NSError to prevent it from being imported by Swift as a method that throws.
ja: NS_SWIFT_NOTHROWマクロをNSErrorを生み出すObjective-Cメソッド宣言上で使って、それがスウィフトによってスローするメソッドとしてインポートされるのを防止してください。

source: Use the weak keyword to indicate that a property has a weak reference to the object stored as its value.
ja: weakキーワードを使用して、あるプロパティがその値として保存しておくオブジェクトへの弱い参照を持つことを示してください。

source: Use these tools to explore Swift’s extensive functionality and integrate it back into your existing Objective-C app without having to rewrite the entire app in Swift at once.
ja: これらのツールを使用して、スウィフトの広大な機能性を調査して、いっぺんにスウィフトでアプリ全体を書き直ししなくとも、それをあなたの既存のObjective-Cアプリに逆に組み込んでください。

source: Use your custom Objective-C code with the same Swift syntax you use with system classes.
ja: あなたのあつらえのObjective-Cコードを、あなたがシステム・クラスで使うのと同じスウィフト構文で使ってください。

source: Using Swift Class Names with Objective-C APIs
ja: スウィフトクラス名をObjective-C APIで使う

source: Using Swift from Objective-C
ja: スウィフトをObjective-Cから使う

source: Using mix and match, you can implement part of your app’s functionality using the latest Swift features and seamlessly incorporate it back into your existing Objective-C codebase.
ja: 混合と適合を使って、あなたは最新のスウィフト特徴を使ってあなたのアプリの機能性の一部を実施して、継ぎ目なくそれをあなたの既存のObjective-Cコードベースにさかのぼって組み込むことができます。

source: Valid arguments
ja: 有効な引数

source: Variadic Functions
ja: 可変長引数関数

source: When id values are imported into Swift as Any, the runtime automatically handles bridging back to either class references or Swift value types.
ja: id値がスウィフトへAnyとしてインポートされる時、ランタイムは自動的にクラス参照またはスウィフト値型のどちらかへ戻すブリッジを取り扱います。

source: When Objective-C methods are imported into Swift, the first part of the Objective-C selector becomes the base method name and appears before the parentheses.
ja: Objective-Cメソッドがスウィフトにインポートされるとき、Objective-Cセレクタの最初の部分は、基盤となるメソッド名になって、丸括弧の前に現れます。

source: When Swift imports APIs that have not been annotated, the compiler cannot automatically memory manage the returned Core Foundation objects.
ja: 注釈をつけられなかったAPIをスウィフトがインポートするとき、コンパイラは返されたコアファウンデーション・オブジェクトを自動的にメモリ管理できません。

source: When Swift imports Core Foundation types, the compiler remaps the names of these types.
ja: スウィフトがコアファウンデーション型をインポートするとき、コンパイラはこれらの型の名前をリマップします。

source: When a Swift class introduces many new methods or properties that require behavior from the Objective-C runtime, use the @objcMembers attribute in the declaration of that class.
ja: あるスウィフトクラスがObjective-Cランタイムからの挙動を要求する多くの新しいメソッドまたはプロパティを導入するならば、@objcMembers属性をそのクラスの宣言において使ってください。

source: When a Swift initializer, property, subscript, or method is used to satisfy a requirement of an Objective-C protocol, the compiler automatically infers the name to match the requirement, similar to what is done for overridden methods.
ja: スウィフトのイニシャライザ、プロパティ、添え字、またはメソッドがObjective-Cプロトコルのある要件を満たすために使われる場合、コンパイラは自動的にその要件と適合する名前を推論します、オーバーライドされたメソッドに対して行われることと同じように。

source: When a function is declared as taking an AutoreleasingUnsafeMutablePointer<Type>, it can accept any of the following:
ja: ある関数がAutoreleasingUnsafeMutablePointer<Type>を取るとして宣言されるとき、それは以下の何でも受け入れることができます：

source: When a function is declared as taking an UnsafeMutablePointer<Type> argument, it can accept any of the following:
ja: ある関数がUnsafeMutablePointer<Type>引数を取るとして宣言されるとき、それは以下の何でも受け入れることができます：

source: When a function is declared as taking an UnsafeMutableRawPointer argument, it can accept the same operands as UnsafeMutablePointer<Type> for any type Type.
ja: ある関数がUnsafeMutableRawPointer引数を取るとして宣言されるとき、それは何らかの型Typeに対するUnsafeMutablePointer<Type>と同じ演算数を受け入れることができます。

source: When a function is declared as taking an UnsafePointer<Type> argument, it can accept any of the following:
ja: ある関数がUnsafePointer<Type>引数を取るとして宣言されるとき、それは以下の何でも受け入れることができます：

source: When a function is declared as taking an UnsafeRawPointer argument, it can accept the same operands as UnsafePointer<Type> for any type Type.
ja: ある関数がUnsafeRawPointer引数を取るとして宣言されるとき、それは何らかの型Typeに対するUnsafePointer<Type>と同じ演算数を受け入れることができます。

source: When accessing a computed property corresponding to a bit field, Swift automatically converts the value to and from compatible Swift types.
ja: あるビットフィールドに対応している計算プロパティにアクセスするとき、スウィフトはその値を自動的に互換性のあるスウィフト型へと、またはそれから、変換します。
